'use strict'
// Работа с переменными
let admin;
let name;
name = 'John';
admin = name;
alert( admin );

// Придумайте правильные имена
// Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?

let myPlanet;
let currentUser;

// Какие буквы (заглавные или строчные) использовать для имён констант?

const BIRTHDAY = '18.04.1982'; // использовать заглавные буквы?

const age = someCode(BIRTHDAY); // а здесь?